/* 
## 문제 6.
아래와 같은 출력 결과가 나타나도록 중첩 반복문을 for 문 형식으로 구현하시오.
1
12
123
1234
12345
123456
1234567
*/


/* 
오답1.문제풀이 첫번째 접근방법...삽질한듯.. 포기 ㅡ,,ㅡ
1
12  (1+11) ->(10의 1제곱 + 1)
123  (12+111) ->(10의2제곱 +10의1제곱 + 1)
1234  (123+1111) ->(10의 3제곱+ 10의 2제곱 + 10의 1제곱 +1)
12345  (1234+1111)
12345  (12345+11111)
123456  (12345+11111)
*/
for(let i=0; i<7; i++){
    for(let j=0; j<i+1; j++){
   
    }
}



//강사님 소스코드
for(let i=0; i<7; i++){
    let str = "";

    for(let j=0; j<i+1; j++){
        str += j+1;
    }
    console.log(str);
}

